FSI/Turek-Hron/FSI2_course/Fluid/0.orig/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |

# Author1: Nithin Adidela, IIT Goa
# email: nithin.adiela.16003@iitgoa.ac.in

# Author2: Revanth Sharma Kollegala, IIT Goa
# email: revanth.sharma.16003@iitgoa.ac.in

# Author3: Y Sudhakar, IIT Goa
# email: sudhakar@iitgoa.ac.in

# Inspired by the contribution by Derek Risseeuw (TU Delft).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cylinder
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    
    flap
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }

    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
